In [5]:
import pandas as pd
import numpy as np

On column: Should be present in both tables, should not contain any repeating values within either original table. It should represent the same thing in both tables.

In [44]:
reg_data = {'reg_id' : ['1', '2', '3', '4'], 'name' : ['Andrew', 'Bob', 'Charlie', 'David']}
#Creating a new dataframe called reg
reg = pd.DataFrame(reg_data)
reg['name']

0     Andrew
1        Bob
2    Charlie
3      David
Name: name, dtype: object

In [45]:
reg

  reg_id     name
0      1   Andrew
1      2      Bob
2      3  Charlie
3      4    David

In [47]:
log_data = {'log_id' : ['1', '2', '3', '4'], 'name' : ['Xavier', 'Andrew', 'Yolanda', 'Bob']}
#Creating a new dataframe called logins
log = pd.DataFrame(log_data)
log['name']

0     Xavier
1     Andrew
2    Yolanda
3        Bob
Name: name, dtype: object

In [48]:
log

  log_id     name
0      1   Xavier
1      2   Andrew
2      3  Yolanda
3      4      Bob

Ok, so I've created two tables to practice with

In [53]:
pd.merge(reg, log, how = 'inner', on = 'name')

  reg_id    name log_id
0      1  Andrew      2
1      2     Bob      4

Only Andrew and Bob are present in both tables, so they are shown here. This is the only fully complete data in the set

I'm moving this workbook over to Pandas Workbook 8 Combining Dataframes Concatenation
----------